askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD_noloader.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
AVRDD_noloader.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDD_noloader.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDD_noloader.menu.90_console_baud.20_separator=-
AVRDD_noloader.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDD_noloader.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDD_noloader.menu.95_bootloader.00_woBootloader=without Bootloader


AVRDU_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDU_noloader.bootloader.BOOTSIZE=0x00
AVRDU_noloader.bootloader.CODESIZE=0x00
AVRDU_noloader.bootloader.OSCCFG=0b00000000
AVRDU_noloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRDU_noloader.bootloader.SYSCFG1=0b000{bootloader.usbsink_bit}000
AVRDU_noloader.bootloader.WDTCFG=0b00000000
AVRDU_noloader.bootloader.bod_lvl=000
AVRDU_noloader.bootloader.bod_mode=00
AVRDU_noloader.bootloader.bod_sample=0
AVRDU_noloader.bootloader.eepupload=
AVRDU_noloader.bootloader.browupload=
AVRDU_noloader.bootloader.urowupload=
AVRDU_noloader.bootloader.fuseupload={bootloader.fuses}
AVRDU_noloader.bootloader.eesave_bit=1
AVRDU_noloader.bootloader.browsave_bit=0
AVRDU_noloader.bootloader.usbsink_bit=01
AVRDU_noloader.bootloader.reset_bit=10
AVRDU_noloader.bootloader.tool=avrdude
AVRDU_noloader.bootloader.updi_bit=1
AVRDU_noloader.bootloader.file=empty/empty.hex
AVRDU_noloader.bootloader.programed_type=
AVRDU_noloader.build.console_select=
AVRDU_noloader.build.export_merged_output=false
AVRDU_noloader.build.text_section_start=.text=0x0
AVRDU_noloader.build.buildopt=-DNDEBUG
AVRDU_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU_noloader.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDU_noloader.build.macroapi=-DENABLE_MACRO_API
AVRDU_noloader.build.printf=
AVRDU_noloader.build.printflt=
AVRDU_noloader.upload.speed=115200
AVRDU_noloader.upload.tool=
AVRDU_noloader.menu.01_variant.22_AVR64DU32.build.board=AVR_AVR64DU32
AVRDU_noloader.menu.01_variant.22_AVR64DU32.build.mcu=avr64du32
AVRDU_noloader.menu.01_variant.22_AVR64DU32.build.variant=avr_du32
AVRDU_noloader.menu.01_variant.22_AVR64DU32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p512.x
AVRDU_noloader.menu.01_variant.22_AVR64DU32.upload.maximum_data_size=8192
AVRDU_noloader.menu.01_variant.22_AVR64DU32.upload.maximum_size=65536
AVRDU_noloader.menu.01_variant.22_AVR64DU32=32pin AVR64DU32 (64KiB+8KiB)
AVRDU_noloader.menu.01_variant.23_AVR32Du32.build.board=AVR_AVR32DU32
AVRDU_noloader.menu.01_variant.23_AVR32Du32.build.mcu=avr32du32
AVRDU_noloader.menu.01_variant.23_AVR32Du32.build.variant=avr_du32
AVRDU_noloader.menu.01_variant.23_AVR32Du32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.23_AVR32Du32.upload.maximum_data_size=4096
AVRDU_noloader.menu.01_variant.23_AVR32Du32.upload.maximum_size=32768
AVRDU_noloader.menu.01_variant.23_AVR32Du32=32pin AVR32DU32 (32KiB+4KiB)
AVRDU_noloader.menu.01_variant.24_AVR16Du32.build.board=AVR_AVR16DU32
AVRDU_noloader.menu.01_variant.24_AVR16Du32.build.mcu=avr16du32
AVRDU_noloader.menu.01_variant.24_AVR16Du32.build.variant=avr_du32
AVRDU_noloader.menu.01_variant.24_AVR16Du32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.24_AVR16Du32.upload.maximum_data_size=2048
AVRDU_noloader.menu.01_variant.24_AVR16Du32.upload.maximum_size=16384
AVRDU_noloader.menu.01_variant.24_AVR16Du32=32pin AVR16DU32 (16KiB+2KiB)
AVRDU_noloader.menu.01_variant.30_separator=-
AVRDU_noloader.menu.01_variant.32_AVR64DU28.build.board=AVR_AVR64DU28
AVRDU_noloader.menu.01_variant.32_AVR64DU28.build.mcu=avr64du28
AVRDU_noloader.menu.01_variant.32_AVR64DU28.build.variant=avr_du28
AVRDU_noloader.menu.01_variant.32_AVR64DU28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p512.x
AVRDU_noloader.menu.01_variant.32_AVR64DU28.upload.maximum_data_size=8192
AVRDU_noloader.menu.01_variant.32_AVR64DU28.upload.maximum_size=65536
AVRDU_noloader.menu.01_variant.32_AVR64DU28=28pin AVR64DU28 (64KiB+8KiB)
AVRDU_noloader.menu.01_variant.33_AVR32DU28.build.board=AVR_AVR32DU28
AVRDU_noloader.menu.01_variant.33_AVR32DU28.build.mcu=avr32du28
AVRDU_noloader.menu.01_variant.33_AVR32DU28.build.variant=avr_du28
AVRDU_noloader.menu.01_variant.33_AVR32DU28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.33_AVR32DU28.upload.maximum_data_size=4096
AVRDU_noloader.menu.01_variant.33_AVR32DU28.upload.maximum_size=32256
AVRDU_noloader.menu.01_variant.33_AVR32DU28=28pin AVR32DU28 (32KiB+4KiB)
AVRDU_noloader.menu.01_variant.34_AVR16DU28.build.board=AVR_AVR16DU28
AVRDU_noloader.menu.01_variant.34_AVR16DU28.build.mcu=avr16du28
AVRDU_noloader.menu.01_variant.34_AVR16DU28.build.variant=avr_du28
AVRDU_noloader.menu.01_variant.34_AVR16DU28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.34_AVR16DU28.upload.maximum_data_size=2048
AVRDU_noloader.menu.01_variant.34_AVR16DU28.upload.maximum_size=16384
AVRDU_noloader.menu.01_variant.34_AVR16DU28=28pin AVR16DU28 (16KiB+2KiB)
AVRDU_noloader.menu.01_variant.40_separator=-
AVRDU_noloader.menu.01_variant.43_AVR32DU20.build.board=AVR_AVR32DU20
AVRDU_noloader.menu.01_variant.43_AVR32DU20.build.mcu=avr32dU20
AVRDU_noloader.menu.01_variant.43_AVR32DU20.build.variant=avr_dU20
AVRDU_noloader.menu.01_variant.43_AVR32DU20.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.43_AVR32DU20.upload.maximum_data_size=4096
AVRDU_noloader.menu.01_variant.43_AVR32DU20.upload.maximum_size=32768
AVRDU_noloader.menu.01_variant.43_AVR32DU20=20pin AVR32DU20 (32KiB+4KiB)
AVRDU_noloader.menu.01_variant.44_AVR16DU20.build.board=AVR_AVR16DU20
AVRDU_noloader.menu.01_variant.44_AVR16DU20.build.mcu=avr16du20
AVRDU_noloader.menu.01_variant.44_AVR16DU20.build.variant=avr_du20
AVRDU_noloader.menu.01_variant.44_AVR16DU20.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.44_AVR16DU20.upload.maximum_data_size=2048
AVRDU_noloader.menu.01_variant.44_AVR16DU20.upload.maximum_size=16384
AVRDU_noloader.menu.01_variant.44_AVR16DU20=20pin AVR16DU20 (16KiB+2KiB)
AVRDU_noloader.menu.01_variant.50_separator=-
AVRDU_noloader.menu.01_variant.53_AVR32DU14.build.board=AVR_AVR32DU14
AVRDU_noloader.menu.01_variant.53_AVR32DU14.build.mcu=avr32du14
AVRDU_noloader.menu.01_variant.53_AVR32DU14.build.variant=avr_du14
AVRDU_noloader.menu.01_variant.53_AVR32DU14.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.53_AVR32DU14.upload.maximum_data_size=4096
AVRDU_noloader.menu.01_variant.53_AVR32DU14.upload.maximum_size=32768
AVRDU_noloader.menu.01_variant.53_AVR32DU14=14pin AVR32DU14 (32KiB+4KiB)
AVRDU_noloader.menu.01_variant.54_AVR16DU14.build.board=AVR_AVR16DU14
AVRDU_noloader.menu.01_variant.54_AVR16DU14.build.mcu=avr16du14
AVRDU_noloader.menu.01_variant.54_AVR16DU14.build.variant=avr_du14
AVRDU_noloader.menu.01_variant.54_AVR16DU14.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDU_noloader.menu.01_variant.54_AVR16DU14.upload.maximum_data_size=2048
AVRDU_noloader.menu.01_variant.54_AVR16DU14.upload.maximum_size=16384
AVRDU_noloader.menu.01_variant.54_AVR16DU14=14pin AVR16DU14 (16KiB+2KiB)
AVRDU_noloader.menu.02_clock.01_24MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.01_24MHz.build.f_cpu=24000000L
AVRDU_noloader.menu.02_clock.01_24MHz=Internal 24 MHz (default)
AVRDU_noloader.menu.02_clock.01_12MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.01_12MHz.build.f_cpu=12000000L
AVRDU_noloader.menu.02_clock.01_12MHz=Internal 12 MHz (The lowest limit for using USB peripherals)
AVRDU_noloader.menu.02_clock.03_6MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.03_6MHz.build.f_cpu=6000000L
AVRDU_noloader.menu.02_clock.03_6MHz=Internal 6 MHz
AVRDU_noloader.menu.02_clock.04_3MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.04_3MHz.build.f_cpu=3000000L
AVRDU_noloader.menu.02_clock.04_3MHz=Internal 3 MHz
AVRDU_noloader.menu.02_clock.10_separator=-
AVRDU_noloader.menu.02_clock.11_20MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.11_20MHz.build.f_cpu=20000000L
AVRDU_noloader.menu.02_clock.11_20MHz=Internal 20 MHz (recommend)
AVRDU_noloader.menu.02_clock.12_10MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.12_10MHz.build.f_cpu=10000000L
AVRDU_noloader.menu.02_clock.12_10MHz=Internal 10 MHz
AVRDU_noloader.menu.02_clock.13_5MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.13_5MHz.build.f_cpu=5000000L
AVRDU_noloader.menu.02_clock.13_5MHz=Internal 5 MHz
AVRDU_noloader.menu.02_clock.20_separator=-
AVRDU_noloader.menu.02_clock.21_16MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.21_16MHz.build.f_cpu=16000000L
AVRDU_noloader.menu.02_clock.21_16MHz=Internal 16 MHz
AVRDU_noloader.menu.02_clock.22_8MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.22_8MHz.build.f_cpu=8000000L
AVRDU_noloader.menu.02_clock.22_8MHz=Internal 8 MHz
AVRDU_noloader.menu.02_clock.23_4MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.23_4MHz.build.f_cpu=4000000L
AVRDU_noloader.menu.02_clock.23_4MHz=Internal 4 MHz
AVRDU_noloader.menu.02_clock.24_2MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.24_2MHz.build.f_cpu=2000000L
AVRDU_noloader.menu.02_clock.24_2MHz=Internal 2 MHz
AVRDU_noloader.menu.02_clock.25_1MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.25_1MHz.build.f_cpu=1000000L
AVRDU_noloader.menu.02_clock.25_1MHz=Internal 1 MHz
AVRDU_noloader.menu.02_clock.30_separator=-
AVRDU_noloader.menu.02_clock.31_32MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.31_32MHz.build.f_cpu=32000000L
AVRDU_noloader.menu.02_clock.31_32MHz=Internal 32 MHz (OVERCLOCK)
AVRDU_noloader.menu.02_clock.32_28MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.32_28MHz.build.f_cpu=28000000L
AVRDU_noloader.menu.02_clock.32_28MHz=Internal 28 MHz (OVERCLOCK)
AVRDU_noloader.menu.02_clock.33_14MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.33_14MHz.build.f_cpu=14000000L
AVRDU_noloader.menu.02_clock.33_14MHz=Internal 14 MHz (OVERCLOCK)
AVRDU_noloader.menu.02_clock.34_7MHz.bootloader.bod_sample=0
AVRDU_noloader.menu.02_clock.34_7MHz.build.f_cpu=7000000L
AVRDU_noloader.menu.02_clock.34_7MHz=Internal 7 MHz (OVERCLOCK)
AVRDU_noloader.menu.02_clock.40_separator=-
AVRDU_noloader.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
AVRDU_noloader.menu.02_clock.41_32768Hz.build.f_cpu=32256
AVRDU_noloader.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
AVRDU_noloader.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVRDU_noloader.menu.11_BODMODE.01_disabled=BOD Disabled
AVRDU_noloader.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVRDU_noloader.menu.11_BODMODE.02_enabled=BOD Enabled
AVRDU_noloader.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVRDU_noloader.menu.11_BODMODE.03_sampled=BOD Sampled
AVRDU_noloader.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVRDU_noloader.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVRDU_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVRDU_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVRDU_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVRDU_noloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVRDU_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVRDU_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVRDU_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVRDU_noloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDU_noloader.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDU_noloader.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDU_noloader.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDU_noloader.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDU_noloader.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVRDU_noloader.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVRDU_noloader.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVRDU_noloader.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVRDU_noloader.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
AVRDU_noloader.menu.24_eeprom.01_keep=Save guard "Retained"
AVRDU_noloader.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
AVRDU_noloader.menu.24_eeprom.02_erase=Save guard "Erase"
AVRDU_noloader.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
AVRDU_noloader.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
AVRDU_noloader.menu.24_eeprom.03_upload=Upload ".eep" file
AVRDU_noloader.menu.25_bootrow.01_erase.bootloader.browsave_bit=0
AVRDU_noloader.menu.25_bootrow.01_erase=Save guard "Erase"
AVRDU_noloader.menu.25_bootrow.02_keep.bootloader.browsave_bit=1
AVRDU_noloader.menu.25_bootrow.02_keep=Save guard "Retained"
AVRDU_noloader.menu.25_bootrow.03_upload.bootloader.browupload={bootloader.bootrow}
AVRDU_noloader.menu.25_bootrow.03_upload=Upload ".brow" file
AVRDU_noloader.menu.26_userrow.02_keep=Save guard "Retained"
AVRDU_noloader.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
AVRDU_noloader.menu.26_userrow.03_upload=Upload ".urow" file
AVRDU_noloader.menu.27_fusefile.01_menu=Specify in the MENU
AVRDU_noloader.menu.27_fusefile.03_upload.bootloader.fuseupload={bootloader.fusefile}
AVRDU_noloader.menu.27_fusefile.03_upload=Upload ".fuse" file (DANGER)
AVRDU_noloader.menu.51_buildopt.01_Release=Build Release (default)
AVRDU_noloader.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDU_noloader.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDU_noloader.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDU_noloader.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDU_noloader.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDU_noloader.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
AVRDU_noloader.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
AVRDU_noloader.menu.52_macroapi.03_Disable.build.macroapi=
AVRDU_noloader.menu.52_macroapi.03_Disable=Macro API Disable
AVRDU_noloader.menu.52_macroapi.04_AllDisable.build.macroapi=
AVRDU_noloader.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
AVRDU_noloader.menu.52_macroapi.04_AllDisable=Standard Library All Disable
AVRDU_noloader.menu.53_printf.01_default=default
AVRDU_noloader.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDU_noloader.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDU_noloader.menu.53_printf.02_full=Float Support
AVRDU_noloader.menu.54_console_select.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A
AVRDU_noloader.menu.54_console_select.01_UART0_A0_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDU_noloader.menu.54_console_select.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7
AVRDU_noloader.menu.54_console_select.02_UART1_D6_LA7.build.console_select=-DSerial=Serial1C
AVRDU_noloader.menu.54_console_select.02_UART1_D6_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDU_noloader.menu.54_console_select.02_UART1_D6_LA7=UART1 TX:PD6 RX:PD7 LED=PA7
AVRDU_noloader.menu.54_console_select.03_UART1_D6_LC3.build.console_select=-DSerial=Serial1C
AVRDU_noloader.menu.54_console_select.03_UART1_D6_LC3.build.led_pin=-DLED_BUILTIN=PIN_PC3
AVRDU_noloader.menu.54_console_select.03_UART1_D6_LC3=UART1 TX:PD6 RX:PD7 LED=PC3
AVRDU_noloader.menu.54_console_select.04_UART1_D6_LF2_SF6.build.console_select=-DSerial=Serial1C
AVRDU_noloader.menu.54_console_select.04_UART1_D6_LF2_SF6.build.led_pin=-DLED_BUILTIN=PIN_PF2 -DSW_BUILTIN=PIN_PF6
AVRDU_noloader.menu.54_console_select.04_UART1_D6_LF2_SF6=UART1 TX:PD6 RX:PD7 LED=PF2 SW=PF6 (AVR64DU32 Curiosity Nano)
AVRDU_noloader.menu.54_console_select.10_separator=-
AVRDU_noloader.menu.54_console_select.11_USB0_LA7.build.console_select=-DSerial=SerialUSB
AVRDU_noloader.menu.54_console_select.11_USB0_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDU_noloader.menu.54_console_select.11_USB0_LA7=USB0 LED=PA7
AVRDU_noloader.menu.54_console_select.13_USB0_LC3.build.console_select=-DSerial=SerialUSB
AVRDU_noloader.menu.54_console_select.13_USB0_LC3.build.led_pin=-DLED_BUILTIN=PIN_PC3
AVRDU_noloader.menu.54_console_select.13_USB0_LC3=USB0 LED=PC3
AVRDU_noloader.menu.54_console_select.14_USB0_LF2_SF6.build.console_select=-DSerial=SerialUSB
AVRDU_noloader.menu.54_console_select.14_USB0_LF2_SF6.build.led_pin=-DLED_BUILTIN=PIN_PF2 -DSW_BUILTIN=PIN_PF6
AVRDU_noloader.menu.54_console_select.14_USB0_LF2_SF6=USB0 LED=PF2 SW=PF6 (AVR64DU32 Curiosity Nano)
AVRDU_noloader.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU_noloader.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDU_noloader.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDU_noloader.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDU_noloader.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDU_noloader.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDU_noloader.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDU_noloader.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDU_noloader.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDU_noloader.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDU_noloader.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDU_noloader.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
AVRDU_noloader.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDU_noloader.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDU_noloader.menu.90_console_baud.20_separator=-
AVRDU_noloader.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
